Repository: acaryca/sitemail-wordpress
Catalog: languages/sitemail-*.po
Languages: fr_fr

source: Email settings
fr_fr: Paramètres d'envoi

source: SiteMail settings saved successfully.
fr_fr: Les paramètres de SiteMail ont été sauvegardés avec succès.

source: Settings
fr_fr: Paramètres

source: Sorry, you do not have permission to access this page.
fr_fr: Désolé, vous n'avez pas l'autorisation d'accéder à cette page.

source: Testing
fr_fr: Test

source: Choose the type of email sending you want to use.
fr_fr: Choisissez le type d'envoi que vous souhaitez utiliser.

source: Sender Name
fr_fr: Nom de l'expéditeur

source: The name that will appear as the sender of your emails.
fr_fr: Le nom qui apparaîtra en tant qu'expéditeur de vos courriels.

source: SiteMail API Key
fr_fr: Clé API SiteMail

source: Enter your SiteMail API key.
fr_fr: Entrez votre clé API SiteMail.

source: SMTP Host
fr_fr: Hôte SMTP

source: SMTP server address (ex: smtp.example.com).
fr_fr: Adresse du serveur SMTP (ex : smtp.example.com).

source: SMTP Port
fr_fr: Port SMTP

source: SMTP server port (ex: 587 for TLS, 465 for SSL).
fr_fr: Port du serveur SMTP (ex : 587 pour TLS, 465 pour SSL).

source: SMTP Username
fr_fr: Nom d'utilisateur SMTP

source: Your SMTP username.
fr_fr: Votre nom d'utilisateur SMTP.

source: SMTP Password
fr_fr: Mot de passe SMTP

source: Your SMTP password.
fr_fr: Votre mot de passe SMTP.

source: Encryption
fr_fr: Chiffrement

source: Type of encryption to use.
fr_fr: Type de chiffrement à utiliser.

source: SMTP Email
fr_fr: Adresse courriel SMTP

source: The email address that will be used to send emails.
fr_fr: L'adresse courriel qui sera utilisée pour envoyer des courriels.

source: Email
fr_fr: Courriel

source: Enter the email address you want to receive the test email.
fr_fr: Saisissez l'adresse courriel à laquelle vous souhaitez recevoir le courriel de test.

source: Send test email
fr_fr: Envoyer un courriel de test

source: Test email via SiteMail
fr_fr: Test du courrier électronique via SiteMail

source: An error occurred while sending the test email.
fr_fr: Une erreur s'est produite lors de l'envoi du courriel de test.

source: Security: Invalid nonce.
fr_fr: Sécurité : Nonce non valide.

source: You do not have sufficient permissions.
fr_fr: Vous n'avez pas les autorisations suffisantes.

source: Please enter a valid email address.
fr_fr: Veuillez saisir une adresse électronique valide.

source: Error: SiteMail API key not configured. Please configure your API key first.
fr_fr: Erreur : La clé API SiteMail n'est pas configurée. Veuillez d'abord configurer votre clé API.

source: This is a test email sent via SiteMail. If you receive this email, the configuration is working correctly. Please verify the sender address to ensure it matches your expected configuration.
fr_fr: Il s'agit d'un e-mail de test envoyé via SiteMail. Si vous recevez cet e-mail, la configuration fonctionne correctement. Veuillez vérifier l'adresse de l'expéditeur pour vous assurer qu'elle correspond à la configuration attendue.

source: Test email sent successfully to %s!
fr_fr: L'e-mail de test a été envoyé avec succès à %s !

source: Failed to send test email. Check configuration and logs for details.
fr_fr: Échec de l'envoi de l'e-mail de test. Vérifiez la configuration et les journaux pour plus de détails.

source: You do not have sufficient permissions to access this page.
fr_fr: Vous ne disposez pas des autorisations suffisantes pour accéder à cette page.

source: This is a test email sent via SiteMail. If you receive this email, the configuration is working correctly. Please verify the sender email address to ensure it matches your expected configuration.
fr_fr: Il s'agit d'un e-mail de test envoyé via SiteMail. Si vous recevez cet e-mail, la configuration fonctionne correctement. Veuillez vérifier l'adresse e-mail de l'expéditeur pour vous assurer qu'elle correspond à la configuration attendue.

source: Failed to send test email: %s
fr_fr: Échec de l'envoi de l'email de test : %s

source: Test email sent successfully to %s! Please check your inbox.
fr_fr: L'e-mail de test a été envoyé avec succès à %s ! Veuillez vérifier votre boîte de réception.

source: API connection successful! URL: %s - Response: %s
fr_fr: Connexion API réussie ! URL : %s - Response : %s

source: Unknown error
fr_fr: Erreur inconnue

source: API connection failed: %s<br>%s<br>%s
fr_fr: Échec de la connexion à l'API : %s<br>%s<br>%s

source: Test direct API SiteMail
fr_fr: Test direct de l'API SiteMail

source: This is a direct test of the SiteMail API. If you receive this email, the configuration is working correctly.
fr_fr: Il s'agit d'un test direct de l'API SiteMail. Si vous recevez cet e-mail, la configuration fonctionne correctement.

source: Email sent successfully via direct API to %s! URL: %s
fr_fr: Courriel envoyé avec succès via l'API directe à %s ! URL : %s

source: Direct API send failed: %s<br>%s<br>%s
fr_fr: L'envoi direct de l'API a échoué : %s<br>%s<br>%s

source: SiteMail: Please <a href="%s">configure your SiteMail API key</a> to enable email sending features or change the email sending method to SMTP.
fr_fr: SiteMail: Veuillez configurer votre <a href="%s">clé API SiteMail</a> pour activer les fonctions d'envoi d'e-mails ou changer la méthode d'envoi d'e-mails en SMTP.

source: No valid recipient
fr_fr: Pas de destinataire valide

source: SiteMail API URL not configured
fr_fr: L'URL SiteMail API n'est pas configurée

source: Connection error: %s
fr_fr: Erreur de connexion : %s

source: Invalid API response: %s
fr_fr: Réponse API non valide : %s

source: Replace WordPress email function with SiteMail or SMTP
fr_fr: Remplacer la fonction email de WordPress par SiteMail ou SMTP
